app/controllers/login_pages_controller.rb

SELECT `login_pages`.* FROM `login_pages`
---
  def index
    @login_pages = LoginPage.all

SELECT `login_pages`.* FROM `login_pages` WHERE `login_pages`.`id` = 1 LIMIT 1
---
  def show
    @login_page=LoginPage.find(params[:id])

INSERT INTO `login_pages` (`Age`, `city`, `country`, `created_at`, `email`, `gender`, `mobile`, `name`, `password`, `remember_me`, `updated_at`, `user_id`) VALUES ('18', 'bsbtgvbfrg', 'Afghanistan', '2014-05-13 07:07:37', 'user@gdc.com', 'male', '54343543', 'vrvrfvfgvdfvdfv', 'vfdvdvv', '1', '2014-05-13 07:07:37', '45')
---
  def create
    @login_page = LoginPage.new(login_page_params)
        if @login_page.save

SELECT `login_pages`.* FROM `login_pages` WHERE `login_pages`.`id` = 1 LIMIT 1
---
  def edit
    #puts params[:id]
    @login_page = LoginPage.find(params[:id])

SELECT `login_pages`.* FROM `login_pages` WHERE `login_pages`.`id` = 1 LIMIT 1
UPDATE `login_pages` SET `password` = 'tewwte', `Age` = '32', `updated_at` = '2014-05-13 07:08:01' WHERE `login_pages`.`id` = 1
---
   def update
       @login_page = LoginPage.find(params[:id])
      if @login_page.update_attributes(login_page_params)

SELECT `login_pages`.* FROM `login_pages` WHERE `login_pages`.`id` = 2 LIMIT 1
---
  def delete
    @login_page = LoginPage.find(params[:id])

DELETE FROM `login_pages` WHERE `login_pages`.`id` = 2
SELECT `login_pages`.* FROM `login_pages` WHERE `login_pages`.`id` = 2 LIMIT 1
---
  def destroy
    login_page = LoginPage.find(params[:id]).destroy